# Authors of the project:
# 1-MachnevEgor_https://vk.com/machnev_egor
# 2-SchalimovDmitriy_https://vk.com/astronaut_without_spaceship
# 3-ArsenyKarimov_https://vk.com/id222338543
# 4-MihailMarkov_https://vk.com/mixxxxail
# Contacts in email:
# 1-meb.official.com@gmail.com
# 2-dmitriy-shalimov@yandex.ru
# 3-arseny.karimov@gmail.com
# 4-mihailmarkov2004@gmail.com

# TOKEN FOR THE BOT
BotToken = "2a0137796fb9abcb4efd8640afc0727d5bc1ef5f4fe353804e705e4aaeca675d4b7195a299010bb160f03"

# system array
CommunityID = ["187254286"]
# talk to the reservation database
ConversationForDataReservationID = 2000000004

# all groups for all classes of the MAI pre-University
EightClassGroups = ["М-8-1-1, Ф-8-1", "М-8-1-2, Ф-8-1", "М-8-1-2, Ф-8-2", "М-8-2-1, Ф-8-1", "М-8-2-1, Ф-8-2",
                    "М-8-2-2, Ф-8-2"]
NineClassGroups = ["М-9-1, Ф-9-1, Р-9-1-2", "М-9-1, Ф-9-1, Р-9-2-1", "М-9-1, Ф-9-1, Р-9-3-1", "М-9-1, Ф-9-1, Р-9-3-2",
                   "М-9-1, Ф-9-2, Р-9-1-1", "М-9-1, Ф-9-2, Р-9-1-2", "М-9-1, Ф-9-2, Р-9-2-1", "М-9-1, Ф-9-2, Р-9-2-2",
                   "М-9-1, Ф-9-2, Р-9-3-1", "М-9-1, Ф-9-2, Р-9-3-2", "М-9-2, Ф-9-1, Р-9-1-2", "М-9-2, Ф-9-1, Р-9-2-1",
                   "М-9-2, Ф-9-1, Р-9-3-1", "М-9-2, Ф-9-1, Р-9-3-2", "М-9-2, Ф-9-2, Р-9-1-1", "М-9-2, Ф-9-2, Р-9-1-2",
                   "М-9-2, Ф-9-2, Р-9-2-2", "М-9-2, Ф-9-2, Р-9-3-1", "М-9-2, Ф-9-2, Р-9-3-2", "М-9-3, Ф-9-3, Р-9-1-1",
                   "М-9-3, Ф-9-3, Р-9-1-2", "М-9-3, Ф-9-3, Р-9-2-1", "М-9-3, Ф-9-3, Р-9-2-2", "М-9-3, Ф-9-3, Р-9-3-2"]
TenClassGroups = ["М-10-1, А-10-1", "М-10-1, А-10-2", "М-10-1, А-10-3", "М-10-2, А-10-1", "М-10-2, А-10-2",
                  "М-10-2, А-10-3", "М-10-3, А-10-1", "М-10-3, А-10-2", "М-10-3, А-10-3"]
ElevenClassGroups = ["М1, Ф1, М-1-1, Р-1-4, Л3", "М1, Ф1, М-1-1, Р-1-4, Л4", "М1, Ф1, М-1-1, Р-3, Л-3",
                     "М1, Ф1, М-2-1, Р1, Л3", "М1, Ф1, М-3-1, Р1, Л3", "М1, Ф1, М-3-1, Р-2, Л3",
                     "М1, Ф1, М-3-1, Р-3, Л3", "М1, Ф4, М-2-1, Р1, Л3", "М1, Ф4, М-3-1, Р1, Л3",
                     "М2, Ф2, М-2-1, Р1, Л2", "М2, Ф2, М-2-1, Р-3, Л2", "М2, Ф2, М-2-1, Р-3, Л3",
                     "М2, Ф2, М-2-1, Р4, Л4", "М2, Ф2, М-3-1, Р1, Л1", "М2, Ф2, М-3-1, Р1, Л2",
                     "М2, Ф2, М-3-1, Р2, Л2", "М2, Ф2, М-3-1, Р4, Л4", "М3, Ф1, М-1-1, Р4, Л4",
                     "М3, Ф1, М-2-1, Р-1, Л3", "М3, Ф1, М-2-1, Р3, Л2", "М3, Ф1, М-2-1, Р3, Л3",
                     "М3, Ф1, М-2-1, Р4, Л4", "М3, Ф1, М-3-1, Р1, Л2", "М3, Ф1, М-3-1, Р2, Л1",
                     "М3, Ф1, М-3-1, Р4, Л4", "М3, Ф4, М-1-1, Р1, Л1", "М3, Ф4, М-1-1, Р4, Л4",
                     "М3, Ф4, М-2-1, Р1, Л1", "М3, Ф4, М-2-1, Р3, Л2", "М3, Ф4, М-2-1, Р4, Л4",
                     "М3, Ф4, М-3-1, Р1, Л2", "М3, Ф4, М-3-1, Р3, Л2", "М3, Ф4, М-3-1, Р4, Л4",
                     "М4, Ф1, М-4-1, Р1, Л1", "М4, Ф1, М-4-1, Р2, Л1", "М4, Ф1, М-4-1, Р4, Л4",
                     "М4, Ф1, М-4-2, Р2, Л1", "М4, Ф1, М-4-2, Р4, Л4", "М4, Ф4, М-4-1, Р1, Л1",
                     "М4, Ф4, М-4-1, Р2, Л1", "М4, Ф4, М-4-1, Р3, Л1", "М4, Ф4, М-4-1, Р3, Л1",
                     "М4, Ф4, М-4-1, Р4, Л4", "М4, Ф4, М-4-2, Р1, Л1", "М4, Ф4, М-4-2, Р2, Л1",
                     "М4, Ф4, М-4-2, Р2, Л3", "М4, Ф4, М-4-2, Р4, Л4"]
# all teachers of the MAI pre-University
TeachersCodifiers = ["АНГЛИЙСКИЙЯЗЫК", "АНДРЕЕВААИ", "АФОНИНАВ", "БАЛЫШАН", "БОЧКАРЕВАЕЭ", "БУЛАТОВАРР", "ГЕОГРАФ",
                     "ГОРДИЕНКОСА", "ДЯТЛОВАА", "ЖИГУЛИНАИ", "ЖИХАРЕВАТЕ", "ЗЕНКИНААЮ", "КАЗАКОВДИ", "КАЛИНИНАДА",
                     "КИСЕЛЕВАЕЮ", "КОЗОДОЙАЕ", "КРУЧИНИНАЕН", "ЛЯПИННА", "МУСИХИНАЕ", "МЯННИККА", "ОЗОЛИНВВ",
                     "ПАНЬКИНАНМ", "ПЕРХУЛОВАМВ", "ПИВОВАРОВАЕА", "ПИВОВАРОВДЕ", "ПОБОЛЕЛОВАЮИ", "РЯЗАНСКИЙ",
                     "СИМОНЯНОО", "СМОЛЯНОВАДЮ", "ТИМОШЕНКОЕА", "ФИЗКУЛЬТУРА", "ХАМИДОВАОР", "ЩЕРБИНААВ", "ЩЕРБИНАЗА",
                     "ЯКИМЕНКОВА"]

# Authors of the project:
# 1-MachnevEgor_https://vk.com/machnev_egor
# 2-SchalimovDmitriy_https://vk.com/astronaut_without_spaceship
# 3-ArsenyKarimov_https://vk.com/id222338543
# 4-MihailMarkov_https://vk.com/mixxxxail
# Contacts in email:
# 1-meb.official.com@gmail.com
# 2-dmitriy-shalimov@yandex.ru
# 3-arseny.karimov@gmail.com
# 4-mihailmarkov2004@gmail.com